jobs/20260724-171328-luqia-vllm-gate-kv-transfer/saturation_gate_results/bench_10_prefill_peak.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x70bf88dcd1b0>, seed=0, num_prompts=20, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=32, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30048', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=1, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-460ff043-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-24 17:25:37 [datasets.py:612] Sampling input_len from [1023, 1023] and output_len from [32, 32]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:02<00:00,  2.09s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 20/20 [00:12<00:00,  1.63it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     20        
Failed requests:                         0         
Maximum request concurrency:             16        
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  12.28     
Total input tokens:                      20460     
Total generated tokens:                  640       
Request throughput (req/s):              1.63      
Output token throughput (tok/s):         52.12     
Peak output token throughput (tok/s):    89.00     
Peak concurrent requests:                9.00      
Total token throughput (tok/s):          1718.31   
---------------Time to First Token----------------
Mean TTFT (ms):                          407.15    
Median TTFT (ms):                        356.77    
P99 TTFT (ms):                           710.61    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          66.88     
Median TPOT (ms):                        67.03     
P99 TPOT (ms):                           68.94     
---------------Inter-token Latency----------------
Mean ITL (ms):                           66.88     
Median ITL (ms):                         66.60     
P99 ITL (ms):                            78.91     
==================================================